{
  "Articles": [
    {
      "category_id": 4, 
      "id": 1, 
      "slug": "animal-kingdom-hermit-crabs-wearing-everthing", 
      "text": "Hermit crabs~ from tiny ones to large and exotic ones!", 
      "title": "Animal Kingdom: Hermit Crabs Wearing EVERYTHING", 
      "url_for_embeded_code": "https://www.youtube.com/embed/tBzgT5godVA"
    }, 
    {
      "category_id": 4, 
      "id": 2, 
      "slug": "cute-furry-giant-panda-ignores-tourists", 
      "text": "Panda Reserve Tour: Giant Pandas are among the world's most endangered animals, only fewer than 1600 are living in the wilderness, the rest are kept in zoos or reserves, taken care of by men. Although cute and funny, they gradually lose interest and stimulation in the wilderness to propagate and move. Help protect Giant Pandas by restricting the occupation of natural reserves, and keep the environment clean!", 
      "title": "Cute Furry Giant Panda Ignores Tourists", 
      "url_for_embeded_code": "https://www.youtube.com/embed/gTY16FDO-BQ"
    }, 
    {
      "category_id": 4, 
      "id": 3, 
      "slug": "which-continent-did-dogs-come-from", 
      "text": "A link to the referenced paper: http://science.sciencemag.org/content/342/6160/871\nThis paper has been widely cited by scientific publications.\nNevertheless, the question is widely debated, so different opinions exist in the field.\n\nWe all know dogs were domesticated from wolves by humans, but on which continent did this first take place? Did people in Africa, Eurasia, America and Australia domesticate wolves separately, or did one of them succeed first, then propagate the new species to the other continents?\n \nBiologists and archaeologists have been working together using genetic analysis to find out the geographic origin of dogs. By comparing DNAs of modern dogs and wolves with those of ancient dogs remains, they have found out that modern dogs most likely originated from Europe. \n\nThe conclusion was based on the genomic data from 18 ancient dog remains. These remains were found in areas today known as Belgium, Russia, USA, Argentina, Switzerland, and Germany. Genetic Analysis shows that the ancient dog remains found in Belgium were the earliest to emerge, and are on the highest node of the evolutionary tree of dogs. \n\nHowever, because no ancient dog remains have been found in Asia or Middle East, it is still unknown whether an earlier origin is located in these area. So the geographic origin of dogs still needs further investigation.\n\n Nevertheless, the study of the continental origin of dogs, combined with the knowledge of human history, can help us understand how human migration has facilitated the evolution of animals. Moreover, the mutual love for dogs among people in different regions, also reflects some universal values that all human beings want to preserve, regardless of their different locations and religions.\n\nAttributions by order of appearance:\nBy One or more images by AlexCovarrubias, Corticopious (Continental models.gif) [Public domain], via Wikimedia Commons\n\nBy brian0918™ (Own work) [Public domain], via Wikimedia Commons\n\nBy Washington Department of Fish and Wildlife [Public domain], via Wikimedia Commons\n\nBy Dr. Karl Rothe, Ferdinand Frank, Josef Steigl [Public domain], via Wikimedia Commons\n\nBy NordNordWest (File:Spreading homo sapiens ru.svg by Urutseg) [Public domain], via Wikimedia Commons", 
      "title": "Which Continent Did Dogs Come From?", 
      "url_for_embeded_code": "https://www.youtube.com/embed/LtxiIuafblY"
    }, 
    {
      "category_id": 3, 
      "id": 4, 
      "slug": "flying-through-clouds-above-mount-everest", 
      "text": "The video was taken on a flight with Sichuan Airlines to depart from Kathmandu to Chengdu, which flew over the Himalayas and the Tibetan Plateau. The airline crew's English was a little lame, however the view from above was awesome!", 
      "title": "Flying through clouds above Mount Everest", 
      "url_for_embeded_code": "https://www.youtube.com/embed/P3sr9xLQpWQ"
    }, 
    {
      "category_id": 3, 
      "id": 5, 
      "slug": "anxiety-treatment-maldives-dhiffushi-island-time-lapse", 
      "text": "Maldives is divers' sanctuary, with nearly 2000 Islands surrounded by coral reefs, diving and snorkeling are very popular here. The majority of the Maldivians prefer to live a quiet and peaceful life. Dhiffushi is about 2 hours' ferry ride from the international airport.", 
      "title": "Anxiety Treatment: Maldives Dhiffushi Island Time Lapse", 
      "url_for_embeded_code": "https://www.youtube.com/embed/U50o92vADOg"
    }, 
    {
      "category_id": 3, 
      "id": 6, 
      "slug": "life-rhythm-in-southeast-asia", 
      "text": "Hongkong to Bangkok -- Public Airport Rail Link and BTS trains in Bangkok are fast, convenient, and colorful. Compared with buses and taxis, trains are cleaner, prices are more reasonable(no need to worry about taximeters and routes), and more beautiful. You can get free Rail Link and BTS map from the shelf inside the airport in Bangkok.", 
      "title": "Life Rhythm In Southeast Asia", 
      "url_for_embeded_code": "https://www.youtube.com/embed/jZStK7nfYYo"
    }, 
    {
      "category_id": 3, 
      "id": 7, 
      "slug": "ferry-trip-on-indian-ocean-in-maldives", 
      "text": "Ferry Trip on Indian Ocean in Maldives", 
      "title": "Ferry Trip on Indian Ocean in Maldives", 
      "url_for_embeded_code": "https://www.youtube.com/embed/5Z0r-Rg60o0"
    }, 
    {
      "category_id": 3, 
      "id": 8, 
      "slug": "meditation-above-the-deepest-part-of-ocean-saipan-in-4k", 
      "text": "Saipan is the largest island of the Northern Mariana Islands in the western Pacific Ocean. The Mariana Trench is the deepest part of the world's oceans. It is located in the western Pacific Ocean, an average of 200 kilometres to the east of the Mariana Islands.", 
      "title": "Meditation Above the Deepest Part of Ocean: Saipan In 4K", 
      "url_for_embeded_code": "https://www.youtube.com/embed/FOr7NvXxQQs"
    }, 
    {
      "category_id": 2, 
      "id": 11, 
      "slug": "why-you-should-think-twice-before-booking-on-airbnb", 
      "text": "In case you are planning an Airbnb trip: unregistered short-term rentals are banned in many areas in UK, Canada and USA, while the rest of the world are relying mainly on luck. In the UK’s case, an Airbnb host was sued by the real estate company for breaching the contract between them. A clause in their contract says the house is “for private residence” only, and the company sued her for renting rooms in the house to guests for just days or weeks. The company’s argument is that such rentals constitute private residence for neither the host nor the guests, and their neighbours’ life was disturbed. The court agreed with the company and decided that short-term rentals should not be allowed in such cases. Since such “for private residence only” clause is very common in real estate contracts, this case has virtually set a precedent for banning all short-term rentals on Airbnb in UK, and hosts who break this law can be punished with a large amount of fine, and even lose the ownership of their houses. Following the case in UK, in last year’s December, Canada’s court also gave a precedent-setting decision to ban such short-term rentals. Their considerations were even more close to the economic and social impacts of Airbnb than the United Kingdom’s. In cities like Toronto and Vancouver, where buying a house is almost impossible for young people, long-term rentals are vital to the stability of society. When an Airbnb host decides to put an apartment on the website for short-term rental, there will be one apartment fewer in the market for long-term rentals. Since the price of short-term rental is considerably higher, it is not surprising that many apartments are advertised as short-term rentals. In addition to the negative impact on the real estate market, driven by profits, hosts can choose to ignore the necessary measures for safety and may cause serious harm to their guests or neighbourhood. In its home country in the United States, Airbnb is still struggling to reach various agreements with State governments. It settled with the New York City last year to agree on the City’s punishing hosts for short-term rentals, using the constitution to defend its freedom of speech and to avoid reducing short-term listings on its website. But in this year’s case with San Francisco, Airbnb has essentially agreed to help the government to register its hosts, collecting data of hosts who rent their rooms for less than a month and sharing data with the government for registrations. In New Orleans and Chicago, Airbnb has reached similar agreements.", 
      "title": "Why You Should Think Twice Before Booking on Airbnb", 
      "url_for_embeded_code": "https://www.youtube.com/embed/-oE8_gxnD3M"
    }, 
    {
      "category_id": 1, 
      "id": 13, 
      "slug": "why-the-idea-of-a-space-nation-is-challenging", 
      "text": "Suspicion on the expenses of the treasury secretary's trip around solar eclipse has raised this question again: is the space owned by a few powerful figures or by the international community?\n\nOuter Space Treaty:\nhttps://www.state.gov/t/isn/5181.htm\nUnder this treaty, the outer space including the moon and other celestial bodies is shared by the whole international community. The Treaty bans States from claiming territories in space, and from deploying nuclear weapons or weapons of mass destruction in it.  The outer space is used by States regardless of their social or economic influence, and its exploration is intended for the benefit of all countries. Significant international cooperation such as the International Space Station has been made since this treaty entered into force. \n\nSo if Asgardia is recognized as a State by the United Nations, which means a State can claim territory in space, then the Outer Space Treaty’s intention of keeping the space as an international resource may be compromised. After all, if one bilionaire can create an Asgardia, it won’t be difficult for other bilionaires to create Asjedi, Asjoda, or some other bizarrely named Space Nations, all they have to do is to gather some data from people and send them into space with a satellite.\n\nIt is fair to say it’s a cool thing to hold a passport issued from the space, but will governments in such Space Nations be effective or will they become tax havens for very rich people, while the rest of their promises, such as religious freedom and non-discrimination, become as void as the outer space? What will happen when Asgardians are able to be sent to a platform in the space, while other earthly citizens have to watch them flying over their heads? Will there be more wars on Earth because people are eager to get a ticket into space? Will there even be wars in the colonies in space? All these questions remain to be answered in the future.", 
      "title": "Why the Idea of a Space Nation is Challenging", 
      "url_for_embeded_code": "https://www.youtube.com/embed/IJbnLlUYnuM"
    }, 
    {
      "category_id": 1, 
      "id": 14, 
      "slug": "why-north-koreas-nuclear-problems-are-hard-to-resolve", 
      "text": "In its advisory opinion of 8 July 1996, the International Court of Justice found that the influence of the use of nuclear weapons on human civilizations and environment could be totally destructive, while the States are independent and sovereign, which means they do have rights to use nuclear weapons for self-defense in armed conflicts under extreme circumstances. So each case involving the use of nuclear weapons needs to be considered separately depending on its own circumstances. \r\nAdvisory Opinion of 8 July 1996 from the International Court of Justice:\r\nhttp://www.icj-cij.org/docket/index.php?p1=3&p2=4&k=e1&p3=4&case=95\r\nAttribution by Order of Appearance:\r\n\r\nInternational Court of Justice: By International Court of Justice; originally uploaded by Yeu Ninje at en.wikipedia. [Public domain], via Wikimedia Commons\r\n\r\nCastle Romeo: By United States Department of Energy [Public domain], via Wikimedia Commons\r\n\r\nUSSArizona PearlHarbor: By U.S. federal government [Public domain], via Wikimedia Commons\r\n\r\nSoldatietiopia: By Vestri Family, photographers in Montevarchi for 3 generations [Public domain], via Wikimedia Commons\r\n\r\nNorth-Korea-missile-launch-in-20060705-en: By created by LERK [Public domain or Public domain], via Wikimedia Commons\r\n\r\nNorth Korea map: By United States Central Intelligence Agency's World Factbook [Public domain], via Wikimedia Commons\r\n\r\nSBD-3 Dauntless bombers of VS-8 over the burning Japanese cruiser Mikuma on 6 June 1942:\r\n\r\nBy Scouting Squadron 8 (VS-8), U.S. Navy; The original uploader was Palm dogg at English Wikipedia, 2006-01-30 (first version); 2006-02-14 (last version) [Public domain], via Wikimedia Commons\r\n\r\nAtomic cloud over Hiroshima: By Enola Gay Tail Gunner S/Sgt. George R. (Bob) Caron [Public domain or Public domain], via Wikimedia Commons", 
      "title": "Why North Korea's Nuclear Problems are Hard to Resolve", 
      "url_for_embeded_code": "https://www.youtube.com/embed/2Y7xjAcmQQc"
    }, 
    {
      "category_id": 1, 
      "id": 12, 
      "slug": "what-if-asteroid-mining-becomes-a-reality-now", 
      "text": "Reference: http://scholarship.law.nd.edu/ndjicl/vol6/iss1/15/\r\nOuter Space Treaty: https://www.state.gov/t/isn/5181.htm\r\n\r\nAsteroid mining will no longer be a fantasy of comic books and science fictions in the near future. Science and technology have rapidly developed to enable us to find out the important minerals in asteroids that can be used to produce electronic devices on earth, and support space travel outside earth. If enough investments can be placed in this adventure, resources extracted from asteroids can be used to refuel space shuttles after they have left earth and dramatically decrease the cost of asteroid mining.  Currently there are already several large corporations making investments in it with the support from their governments.\r\n\r\nThe other side of this huge opportunity is the extreme danger in it. Because currently there is only one effective treaty that regulates space exploration, which is the Outer Space Treaty, and there is a loophole in this treaty that allows corporations or individuals to claim territories in outer space, this opens possibilities for national governments to control territories in space through the corporations under their regime. If each country passes its own laws to allow its corporations to have property rights to the asteroid they mine, then what happens if one corporation from China and another one from the U.S. both mine the same asteroid in space? If we use the old way of colonization in space, then we will have endless wars to fight, because of the huge number of asteroids out there. That is why asteroid mining can be a disaster for human civilizations, and why new international space law is necessary to asteroid mining.\r\n\r\nAttributions by order of appearance:\r\nLaunch of Apollo 15: By NASA  [Public domain], via WIkimedia commons\r\nSTS115_Atlantis_undock_ISS.jpg: NASA derivative work: The High Fin Sperm Whale (STS115_Atlantis_undock_ISS.jpg) [Public domain], via Wikimedia Commons\r\nDawn spacecraft in asteroid belt.jpg: By NASA [Public domain],via Wikimedia Commons\r\n433eros.jpg: By NASA/NEAR Project (JHU/APL). [Public domain], via Wikimedia Commons", 
      "title": "What If Asteroid Mining Becomes A Reality Now?", 
      "url_for_embeded_code": "https://www.youtube.com/embed/Hirk4Qs2k-g"
    }, 
    {
      "category_id": 3, 
      "id": 9, 
      "slug": "why-chinas-great-wall-is-no-longer-being-built", 
      "text": "The illustrations in the video were made from the following materials, in order to show the changes of the Great Wall in different dynasties. Map of the Great Wall of China： By Maximilian Dörrbecker (Chumwa) [CC BY-SA 2.5 (http://creativecommons.org/licenses/by-sa/2.5)], via Wikimedia Commons Territories of Dynasties in China： Pojanji from wikipedia [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons ", 
      "title": "Why China's Great Wall is No Longer Being Built", 
      "url_for_embeded_code": "https://www.youtube.com/embed/YYnyt3DUvAU"
    }, 
    {
      "category_id": 1, 
      "id": 15, 
      "slug": "why-tesla-car-isnt-named-carx", 
      "text": "Note: The image of Tesla's mother is not in the public domain, so this video used an artwork of a mother as a visual aid.\r\nAttributions of Public Domain Images:\r\nMagnet0873.png: By Newton Henry Black [Public domain], via Wikimedia Commons\r\nN.Tesla.JPG: [Public domain], via Wikimedia Commons\r\nMilutin Tesla.jpg: [Public domain], via Wikimedia Commons\r\nPortrait of his Mother Jane Leavitt Hunt.jpeg: William Morris Hunt [Public domain], via Wikimedia Commons\r\nTeslaWirelessPower1891.png: By Nikola Tesla [Public domain], via Wikimedia Commons\r\nTeslathinker.jpg: [Public domain], via Wikimedia Commons\r\nTesla boat1.jpg: By Nikola Tesla 1898 (Nikola Tesla Museum, Belgrad) [Public domain], via Wikimedia Commons\r\nTesla Broadcast Tower 1904.jpeg:  [Public domain], via Wikimedia Commons", 
      "title": "Why Tesla Car isn't Named CarX", 
      "url_for_embeded_code": "https://www.youtube.com/embed/F4MSIZAdZHQ"
    }
  ]
}
